cases/runs/pipecyl20m__20251125-112012__algo/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  Field          | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   Operation      | Version:  11                                    |
|   \\  /    And            | Web:      www.openfoam.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}

// Unidades en metros
convertToMeters 1;

// Radio del pipe = 0.175 m
// Longitud del pipe = 20 m (eje x)

// Vértices del O-grid (5 bloques) – eje del tubo en x
vertices
(
    // block0 (cuadrante superior)
    (0    -0.04375   0.04375)    // 0
    (0    -0.123744  0.123744)   // 1
    (0     0.123744  0.123744)   // 2
    (0     0.04375   0.04375)    // 3

    (20   -0.04375   0.04375)    // 4
    (20   -0.123744  0.123744)   // 5
    (20    0.123744  0.123744)   // 6
    (20    0.04375   0.04375)    // 7

    // block1 (cuadrante inferior derecho)
    (0     0.04375  -0.04375)    // 8
    (0     0.123744 -0.123744)   // 9
    (20    0.04375  -0.04375)    // 10
    (20    0.123744 -0.123744)   // 11

    // block3 (cuadrante inferior izquierdo)
    (0    -0.04375  -0.04375)    // 12
    (0    -0.123744 -0.123744)   // 13
    (20   -0.04375  -0.04375)    // 14
    (20   -0.123744 -0.123744)   // 15
);

// N° de celdas (MISMO en todas las direcciones y bloques
// para evitar inconsistencias entre caras compartidas)

xcells   32;
ycells   32;
zcells   128;

xcells1  32;
ycells1  32;
zcells1  128;

// sin grading fuerte (todo uniforme)
stretch  1;

blocks
(
    // block0 (arriba)
    hex (0 3 2 1 4 7 6 5)   ($xcells $ycells $zcells)  simpleGrading (1 1 1)

    // block1 (derecha abajo)
    hex (3 8 9 2 7 10 11 6) ($xcells $ycells $zcells)  simpleGrading (1 1 1)

    // block2 (abajo)
    hex (8 12 13 9 10 14 15 11) ($xcells $ycells $zcells) simpleGrading (1 1 1)

    // block3 (izquierda abajo)
    hex (12 0 1 13 14 4 5 15) ($xcells $ycells $zcells)  simpleGrading (1 1 1)

    // block4 (centro)
    hex (0 12 8 3 4 14 10 7) ($xcells1 $ycells1 $zcells1) simpleGrading (1 1 1)
);

edges
(
    // Arcos en la pared cilíndrica (radio = 0.175 m)

    // block0 arc (cuadrante superior)
    arc 1 2  (0   0        0.175)
    arc 5 6  (20  0        0.175)

    // block1 arc (cuadrante derecha)
    arc 2 9  (0   0.175    0)
    arc 6 11 (20  0.175    0)

    // block2 arc (cuadrante inferior)
    arc 9 13 (0   0       -0.175)
    arc 11 15 (20  0      -0.175)

    // block3 arc (cuadrante izquierda)
    arc 1 13 (0  -0.175    0)
    arc 5 15 (20 -0.175    0)
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 1 2 3)
            (2 3 8 9)
            (8 9 13 12)
            (13 12 0 1)
            (0 3 8 12)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (4 5 6 7)
            (6 7 10 11)
            (15 11 10 14)
            (15 14 4 5)
            (4 7 10 14)
        );
    }

    walls
    {
        type wall;
        faces
        (
            (1 5 6 2)
            (2 6 11 9)
            (9 11 15 13)
            (15 13 5 1)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
