cases/runs/pipecyl20m__20251125-112012__algo/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    inlet
    {
        type            patch;
        nFaces          5120;
        startFace       1952768;
    }
    outlet
    {
        type            patch;
        nFaces          5120;
        startFace       1957888;
    }
    walls
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          16384;
        startFace       1963008;
    }
)

// ************************************************************************* //
