cases/runs/pipecyl20m__20251125-112012__algo/0/wallShearStress
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      wallShearStress;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    outlet
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    walls
    {
        type            calculated;
        value           nonuniform List<vector> 
16384
(
(-0.0166273 0 0)
(-0.0166273 0 0)
(-0.0166273 0 0)
(-0.0166273 0 0)
(-0.0166273 0 0)
(-0.0166273 0 0)
(-0.0166273 0 0)
(-0.0166273 0 0)
...
)
;
    }
}


// ************************************************************************* //
